{"score": 6, "category": "source_based", "description": "An essay in this category demonstrates clear and consistent mastery, although it may have a\nfew minor errors. A typical essay effectively and insightfully develops a point of view on the issue and\ndemonstrates outstanding critical thinking; the essay uses clearly appropriate examples, reasons, and other\nevidence taken from the source text(s) to support its position; the essay is well organized and clearly focused,\ndemonstrating clear coherence and smooth progression of ideas; the essay exhibits skillful use of language,\nusing a varied, accurate, and apt vocabulary and demonstrates meaningful variety in sentence structure; the\nessay is free of most errors in grammar, usage, and mechanics."}
{"score": 5, "category": "source_based", "description": "An essay in this category demonstrates reasonably consistent mastery, although it will have\noccasional errors or lapses in quality. A typical essay effectively develops a point of view on the issue and\ndemonstrates strong critical thinking; the essay generally using appropriate examples, reasons, and other\nevidence taken from the source text(s) to support its position; the essay is well organized and focused,\ndemonstrating coherence and progression of ideas; the essay exhibits facility in the use of language, using\nappropriate vocabulary demonstrates variety in sentence structure; the essay is generally free of most errors in\ngrammar, usage, and mechanics."}
{"score": 4, "category": "source_based", "description": "An essay in this category demonstrates adequate mastery, although it will have lapses in\nquality. A typical essay develops a point of view on the issue and demonstrates competent critical thinking; the\nessay using adequate examples, reasons, and other evidence taken from the source text(s) to support its\nposition; the essay is generally organized and focused, demonstrating some coherence and progression of ideas\nexhibits adequate; the essay may demonstrate inconsistent facility in the use of language, using generally\nappropriate vocabulary demonstrates some variety in sentence structure; the essay may have some errors in\ngrammar, usage, and mechanics."}
{"score": 3, "category": "source_based", "description": "An essay in this category demonstrates developing mastery, and is marked by ONE OR\nMORE of the following weaknesses: develops a point of view on the issue, demonstrating some critical\nthinking, but may do so inconsistently or use inadequate examples, reasons, or other evidence taken from the\nsource texts to support its position; the essay is limited in its organization or focus, or may demonstrate some\nlapses in coherence or progression of ideas displays; the essay may demonstrate facility in the use of language,\nbut sometimes uses weak vocabulary or inappropriate word choice and/or lacks variety or demonstrates\nproblems in sentence structure; the essay may contain an accumulation of errors in grammar, usage, and\nmechanics."}
{"score": 2, "category": "source_based", "description": "An essay in this category demonstrates little mastery, and is flawed by ONE OR MORE of\nthe following weaknesses: develops a point of view on the issue that is vague or seriously limited, and\ndemonstrates weak critical thinking; the essay provides inappropriate or insufficient examples, reasons, or\nother evidence taken from the source text to support its position; the essay is poorly organized and/or focused,\nor demonstrates serious problems with coherence or progression of ideas; the essay displays very little facility\nin the use of language, using very limited vocabulary or incorrect word choice and/or demonstrates frequent\nproblems in sentence structure; the essay contains errors in grammar, usage, and mechanics so serious that\nmeaning is somewhat obscured."}
{"score": 1, "category": "source_based", "description": "An essay in this category demonstrates very little or no mastery, and is severely flawed by\nONE OR MORE of the following weaknesses: develops no viable point of view on the issue, or provides little\nor no evidence to support its position; the essay is disorganized or unfocused, resulting in a disjointed or\nincoherent essay; the essay displays fundamental errors in vocabulary and/or demonstrates severe flaws in\nsentence structure; the essay contains pervasive errors in grammar, usage, or mechanics that persistently\ninterfere with meaning."}
{"score": 6, "category": "independent", "description": "An essay in this category demonstrates clear and consistent mastery, although it may have a\nfew minor errors. A typical essay effectively and insightfully develops a point of view on the issue and\ndemonstrates outstanding critical thinking, using clearly appropriate examples, reasons, and other evidence to\nsupport its position; the essay is well organized and clearly focused, demonstrating clear coherence and\nsmooth progression of ideas; the essay exhibits skillful use of language, using a varied, accurate, and apt\nvocabulary and demonstrates meaningful variety in sentence structure; the essay is free of most errors in\ngrammar, usage, and mechanics."}
{"score": 5, "category": "independent", "description": "An essay in this category demonstrates reasonably consistent mastery, although it will\nhave occasional errors or lapses in quality. A typical essay effectively develops a point of view on the issue\nand demonstrates strong critical thinking, generally using appropriate examples, reasons, and other evidence\nto support its position; the essay is well organized and focused, demonstrating coherence and progression of\nideas; the essay exhibits facility in the use of language, using appropriate vocabulary demonstrates variety in\nsentence structure; the essay is generally free of most errors in grammar, usage, and mechanics."}
{"score": 4, "category": "independent", "description": "An essay in this category demonstrates adequate mastery, although it will have lapses in\nquality. A typical essay develops a point of view on the issue and demonstrates competent critical thinking,\nusing adequate examples, reasons, and other evidence to support its position; the essay is generally organized\nand focused, demonstrating some coherence and progression of ideas exhibits adequate; the essay may\ndemonstrate inconsistent facility in the use of language, using generally appropriate vocabulary demonstrates\nsome variety in sentence structure; the essay may have some errors in grammar, usage, and mechanics."}
{"score": 3, "category": "independent", "description": "An essay in this category demonstrates developing mastery, and is marked by ONE OR\nMORE of the following weaknesses: develops a point of view on the issue, demonstrating some critical\nthinking, but may do so inconsistently or use inadequate examples, reasons, or other evidence to support its\nposition; the essay is limited in its organization or focus, or may demonstrate some lapses in coherence or\nprogression of ideas displays; the essay may demonstrate facility in the use of language, but sometimes\nuses weak vocabulary or inappropriate word choice and/or lacks variety or demonstrates problems in\nsentence structure; the essay may contain an accumulation of errors in grammar, usage, and mechanics."}
{"score": 2, "category": "independent", "description": "An essay in this category demonstrates little mastery, and is flawed by ONE OR MORE of\nthe following weaknesses: develops a point of view on the issue that is vague or seriously limited, and\ndemonstrates weak critical thinking, providing inappropriate or insufficient examples, reasons, or other\nevidence to support its position; the essay is poorly organized and/or focused, or demonstrates serious\nproblems with coherence or progression of ideas; the essay displays very little facility in the use of\nlanguage, using very limited vocabulary or incorrect word choice and/or demonstrates frequent problems in\nsentence structure; the essay contains errors in grammar, usage, and mechanics so serious that meaning is\nsomewhat obscured."}
{"score": 1, "category": "independent", "description": "An essay in this category demonstrates very little or no mastery, and is severely flawed by\nONE OR MORE of the following weaknesses: develops no viable point of view on the issue, or provides\nlittle or no evidence to support its position; the essay is disorganized or unfocused, resulting in a disjointed or\nincoherent essay; the essay displays fundamental errors in vocabulary and/or demonstrates severe flaws in\nsentence structure; the essay contains pervasive errors in grammar, usage, or mechanics that\npersistently interfere with meaning."}
